#include <Windows.h>
#include <ctime>
#include <iostream>

using namespace std;
string question[15][5][2];//второй раздел на реплики после ответов, нулевое значение для вопроса,первое для правильного ответа
short* history = new short[15];
short historyAns[4];
short chois;
short point = 0;
short krapPoint = 0;
short mainHp = 1;
short hp = 0;
short gameTime = 60;
short mainHelp = 1;
short hard = 5;
short chek(short  numberq, short hard, bool ans_que) {
	srand(time(0));
	for (int i = 0; i < hard; i++) {
		if (history[i] == numberq && ans_que == 0) {
			numberq = (rand() % 14) + 1;
			i = 0;
		}
		else if (historyAns[i] == numberq && ans_que == 1) {
			numberq = (rand() % 4) + 1;
			i = 0;
		}
	}
	return numberq;
}
void game(int hard) {
	srand(time(0));
	short help = mainHelp;
	hp = mainHp;
	short answer;
	cout << question[0][0][0] << endl;
	for (int i = 0; i < hard; i++) {
		short numberq;
		system("cls");
		if (i == 0) {
			numberq = 0;
		}
		else {
			numberq = (rand() % 14) + 1;
			numberq = chek(numberq, hard, 0);
		}
		history[i] = numberq;
		cout << question[numberq][0][0] << "\t\t Жизни: " << hp << endl;
		for (int j = 1; j < 5; j++) {
			short numberAns = (rand() % 4) + 1;
			numberAns = chek(numberAns, 4, 1);
			historyAns[j] = numberAns;
			cout << j << " " << question[numberq][numberAns][0] << endl;
		}
		if (help == 1) {
			cout << "5 Подсказка\n";
		}
		cout << "Введите вариант ответа ";
		cin >> answer;
		while (((answer < 1 || answer>4) && help == 0) || ((answer < 1 || answer>5) && help == 1)) {
			cout << " + балл к тому что ты карапитек введи нормально ";
			krapPoint++;
			cin >> answer;
		}
		if (historyAns[answer] == 1) {
			point++;

		}
		else if (historyAns[answer] == 4) {
			krapPoint++;
		}
		//Кусок кода отвечающий за 50/50
		else if (answer == 5) {
			system("cls");
			cout << "1 " << question[numberq][1][0] << endl;
			cout << "4 " << question[numberq][4][0] << endl;
			help--;
			cin >> answer;
			while (answer != 1 && answer != 4) {
				cout << " + балл к тому что ты карапитек введи нормально ";
				krapPoint++;
				cin >> answer;
			}
			if (question[numberq][1][0] == question[numberq][answer][0]) {
				point++;
			}
			else if (question[numberq][4][0] == question[numberq][answer][0]) {
				krapPoint++;
			}
			else {
				hp--;
			}
			//Конец куска кода
		}
		else {
			hp--;
		}
		system("cls");
		cout << question[numberq][historyAns[answer]][1];
		Sleep(3000);
		if (hp == 0) {

			return;
		}

	}
}
void Settings() {

	system("cls");
	cout << "[1] Настройка сложности\n";
	cout << "[2] Колличество жизней\n";
	//cout << "[3] Время\n";
	cout << "[3] Подсказка\n";
	cout << "[4] Выход\n";
	chois = 0;

	while (chois < 1 || chois > 4)
	{
		cin >> chois;
		switch (chois)
		{
		case 1: {
			system("cls");
			cout << "[1] 5 вопросов" << endl;
			cout << "[2] 10 вопросов" << endl;
			cout << "[3] 15 вопросов" << endl;
			cout << "[4] Выход\n";
			chois = 0;
			while (chois < 1 || chois > 4)
			{

				cin >> chois;
				switch (chois)
				{
				case 1: {
					hard = 5;
					break;
				}
					  break;
				case 2: {
					hard = 10;
					break;
				}
					  break;
				case 3: {
					hard = 15;
					break;
				}
				case 4: {
					return;
					system("cls");
				}
					  break;
				default:
					cout << "Этой команды нет в списке\n";
					cout << "Введите команду: ";
					chois = 0;
					break;
				}
			}
		}
			  break;

		case 2: {
			system("cls");
			cout << "[1] 1 Жизнь " << endl;
			cout << "[2] 3 Жизни " << endl;
			cout << "[3] Бессмертие" << endl;
			chois = 0;
			while (chois < 1 || chois > 4)
			{

				cin >> chois;
				switch (chois)
				{
				case 1: {
					mainHp = 1;
				}
					  break;
				case 2: {
					mainHp = 3;
				}
				case 3: {
					mainHp = 1000;
				}
				case 4: {
					return;
					system("cls");
				}
					  break;

				default:
					cout << "Этой команды нет в списке\n";
					cout << "Введите команду: ";
					chois = 0;
					break;
				}
			}
		}

			  break;
		case 7: {
			system("cls");
			cout << "[1] 10 секунд на ответ " << endl;
			cout << "[2] 30 секунд на ответ" << endl;
			cout << "[3] 60 секунд на ответ" << endl;
			cout << "[4] Выход" << endl;
			chois = 0;
			while (chois < 1 || chois > 4)
			{

				cin >> chois;
				switch (chois)
				{
				case 1: {
					gameTime = 10;
				}
					  break;
				case 2: {
					gameTime = 30;
				}
				case 3: {
					gameTime = 60;
				}
				case 4: {
					return;
					system("cls");
				}
					  break;

				default:
					cout << "Этой команды нет в списке\n";
					cout << "Введите команду: ";
					chois = 0;
					break;
				}
			}
		}
			  break;
		case 3: {
			system("cls");
			cout << " Выберите порядок ходов" << endl;
			cout << "[1] Наличие подсказки" << endl;
			cout << "[2] Отсутствие подсказки" << endl;
			cout << "[3] Выход" << endl;
			chois = 0;
			while (chois < 1 || chois > 2)
			{

				cin >> chois;
				switch (chois)
				{
				case 1: {
					mainHelp = 1;
				}
					  break;
				case 2: {
					mainHelp = 0;
				}
					  break;
				case 3: {
					return;
					system("cls");
				}
					  break;
				default:
					cout << "Этой команды нет в списке\n";
					cout << "Введите команду: ";
					chois = 0;
					break;
				}
			}
		}
			  break;
		case 4: {
			return;
			system("cls");
		}
		default:
			cout << "Этой команды нет в списке\n";
			cout << "Введите команду: ";
			chois = 0;
			break;
		}
		system("cls");
		break;
	}

}
void rule() {
	system("cls");
	cout << "Просто отвечай на вопросы да и все, если ты не крапитек отвечай за 10 сек поехали)" << endl;
	cout << "Ты все знаешь вперед:)" << endl;
	Sleep(3000);
	system("cls");
}
int main()
{

	question[0][0][0] = "Начнем с простого вы карапитек?";
	question[1][0][0] = "На какой планете мы живем?";
	question[2][0][0] = "Сколько символов в этой строке?";
	question[3][0][0] = "Самое большое животное на земле?";
	question[4][0][0] = "Вот очень сложный вопрос: 1+1=?";
	question[5][0][0] = "Какой правильный вариант числа ПИ?";
	question[6][0][0] = "Чем является натрий?";
	question[7][0][0] = "Продолжите: Some body...";
	question[8][0][0] = "Кто придумал мем Канохахаха";
	question[9][0][0] = "Платье синее или золотое?";
	question[10][0][0] = "Татьяна Витальевна, а можно пойти...";
	question[11][0][0] = "Фамилия нашей химички";
	question[12][0][0] = "Я уже не человек я...";
	question[13][0][0] = "Цитаты Николаенко 'Какой ... это сделал'";
	question[14][0][0] = "Чья цитата : Мы делаем подвиги для тех кому до нас нет дела, а любят нас те кому мы нужны и без всяких подвигов";

	question[0][1][0] = "нет";
	question[0][1][1] = "Хорошо продолжим доказывать обратное";
	question[0][2][0] = "Да";
	question[0][2][1] = "Мы не сомневались";
	question[0][3][0] = "Кто?";
	question[0][3][1] = "Объесняем для карапитеков - КАРАПИТЕК ";
	question[0][4][0] = "Уга-Буга";
	question[0][4][1] = "Продолжайте в том же духе";

	question[1][1][0] = "Земля";
	question[1][1][1] = "А я думал Вода";
	question[1][2][0] = "Пицца";
	question[1][2][1] = "Передайте привет Михаилу Колычеву";
	question[1][3][0] = "Ты че на шаре живешь?";
	question[1][3][1] = "######################################@##@=%====++====%%%==+==%@%%@%@@@#%%%################################\n#########################################%==+++++++++==++**::*++=+==%%=%=+++@##@###########################\n########################################%==+***+*****+**:::---:+=+++++*++%==+%@@###########################\n#######################################@=+++***::*:*:**::------*%=++****+==%===%@@#########################\n#######################################==++*****::::::*::::-:-::+=*=**:**+=%@%%%@%#########################\n######################################@=++*****:::::::::::::::::*%*=**::*+=%%@@%@@@########################\n######################################%++**:::::::::::::::-::::::*+***:**+==@%@@@##########################\n######################################=+****::::::::::::-------:::**:::***+=@%%%@##########################\n######################################=+*+:::*::::::::-----------::::::**++=%@@%@##########################\n######################################%=====++****:::::::::::------:::**+++%%@@%@##########################\n######################################@@@%%%@@@%%=*::*****:::::::::::::*++=@%@#@@##########################\n#####################################@=@@%%####@@=*::*+%%%@@@%%==+****++++%@@@#############################\n#####################################%++=++**++==+::-:*=%@@@@##@@%%====+++%%%++%###########################\n#####################################%+*******:***---::***+++=@@%%%%%+***+==%@@%###########################\n#####################################%+**::--::**:---:::--::*******::::*+=%=+=%############################\n#####################################@=+*:::::*+*-.-::::------------::*+=+==*%#######@=++%#################\n######################################%=+::::*+:-.--:***:-------::::**+=+***%########%+***=%==%@###########\n###########@:::+######################%=+*:::*+:----:::+*::---:::**+++=+++*##########%=+****::*+@##########\n###########@*::**+**###############%%%%=+**:::+=+**++++**:::::::**+++==++%###########@%=++==+**+%##########\n############=***+=***=###########@%%%%%%=+*****=%%%%=+*--::::****++==@#@@@@%@########@%=++=%=+++=@#########\n########=::*+**:*++***=#####%@%==%%%=%%%=+++***:**:::-----::***++===@#@@%%%%==%=%@###@=++*+=%=+**=@########\n#######%:-::*+***+++***=##%%%%===%%%==%%%=+====*------::::::**++===@@%%%%%====%=====@%=+**+%%=+*::*+%@@####\n########*:::*++*:**+*::*+%%%%%%===%=*--:%%=++==@#####%+++****++==%%@%======+::::*======++*+%%=+**::*=%%@@@@\n########=:::*++*::**+*::*+=%=%%%%==+:---*%===++*::*****:**++==%%=%@%%%====*:----*===++==++=%%===+++=@######\n########@*:::*++*:****:::*+===%%%%%+:---:+%===%%%%====++++===%=%%%%%%====+*:---:+==+****++=@@%%=+++%#######\n#########*::::****:::::----:+=%%%%%=::---:=%=+***+++***+++=%%=%%%%%%%====*::--:+==++****+=%%%%%=+++=#######\n#########=:::::***----:::--::*%%%%%=+:::::*%@=+****:***+%@@%@@%%%%%=====*:::::*=++++++++===%%%%=+++=#######\n##########*::*::*+*---:**:--::*=%%%%=*-----=@##@%====%###@@@@%%%%%=====+*:::**+**:::*+=====%%===+++=#######\n##########%*:*::*+**:::***:-.--:*=%@@+:----:@#####@@@####@@@%==%%======*::*++=+*****++====%%===++**=#######\n###########=**::*+***:::*+:----::*+%@%:-----+@@@###@@##@@@@@%====%%===*****+==++*****++===%%==++**+@#######";
	question[1][4][0] = "Планета? ээээээ";
	question[1][4][1] = "Принесите кусок мяса этому джентельмену";

	question[2][1][0] = "31";//правильный
	question[2][1][1] = "Мы же знаем что вы посчитали до 22";//правильный
	question[2][3][0] = "17";
	question[2][3][1] = "Что ж вы ленитесь считать";
	question[2][2][0] = "21";
	question[2][2][1] = "Что пальчиков нехватило?";
	question[2][4][0] = "ддцэущаршлктыгжр";
	question[2][4][1] = "Уберите его от клавиатуры";

	question[3][1][0] = "Синий кит";
	question[3][1][1] = "Да но ты осторожнее с этим";
	question[3][2][0] = "Слон";
	question[3][2][1] = "Что делал слон когда пришел На|поле|он)";
	question[3][3][0] = "Муравей";
	question[3][3][1] = "Хах ну почти только общий вес муравьев 40 млрд тонн";
	question[3][4][0] = "Хахыыыы кАораПатЕк";
	question[3][4][1] = "Та не вы а Животное, а впрочем... +1 бал";

	question[4][1][0] = "1+1=2";
	question[4][1][1] = "Даже Карапитек так может)";
	question[4][2][0] = "1+1=11";
	question[4][2][1] = "О да вы JS программист";
	question[4][3][0] = "Ну 1+1=? что не понятного то";
	question[4][3][1] = "Не ну мне с вами уже все понятно";
	question[4][4][0] = "Одно капье.. Агонь.. Ооо еще копье хыыы и Мамант";
	question[4][4][1] = "Окей 5 баллов зв абстрактное мышление";

	question[5][1][0] = "3.14";
	question[5][1][1] = "Мы же знаем что это не совсем правда";
	question[5][2][0] = "4";
	question[5][2][1] = "А ну все у вашей машины квадратные колеса";
	question[5][3][0] = "3";
	question[5][3][1] = "А теперь скажи мне тоже самое на float";
	question[5][4][0] = "Число Пи находится здесь";
	question[5][4][1] = "Ты только быстро не произноси";

	question[6][1][0] = "Щелочной метал";
	question[6][1][1] = "Почему я должен каждый раз делать смешные вопросы и шутки?";
	question[6][2][0] = "Метал";
	question[6][2][1] = "Здесь нет шуток";
	question[6][3][0] = "Неметал";
	question[6][3][1] = "Ну и? ты не прав.";
	question[6][4][0] = "Чего чего?";
	question[6][4][1] = "Короче иди дальше там веселей";

	question[7][1][0] = "Once told me";
	question[7][1][1] = "                                                                                                                                                  ...---...                                            \n                                     ...   ..-*+********-..                      ..:-.              \n            ..-:..                 ..=+-.. .*+==++********..  ....         .   ..*++++.....         \n      ..::...*+++*.                .*%%=*-.+====%%+******++....**..              :%%%%.*++=-.       \n      .=++++.+%%%+.                    .-===%%%%@@@====%%%=+.-+++-.              *====*====+.       \n      .====%-+====.             ..    ..-+++==@@+@=++%#@@===++-....            ..====%===%%::..     \n   ..:*:%%%=+*=++=:.          ...%=--::==++++++===++***====+*-.-=%-      ......-========%%++++*.    \n   -==++=@====++++=-.    ......-*%%==%%@==%%@@@@#@%======+*++=@%%%+.....-++++*================..    \n   .:%=%%==++++++++++-...---..-:*%@%%@#%=%@%==++==@@@%===%%=+=%@%%%:-...-======+====+=+===%%+.....  \n  ....+%=%++++=++==+++++*++*++::*@@@@@@==%=%#@@@%%+****+++=%+%@@%%@*----.-===%=========+===%=%=+++. \n .-++=+%%=+++====++++=========:-*@@@@@@=====###@%+*+:==%#%+=+@@@%@%*:-:----:============++========. \n .=+++===+++=+==++++++===%=*:--:*@@##@#%=====#@@########+++++###@%%*:::::::::+======++=+=====-....  \n ..+%%%%=++=++=++++++==%+::**:::+@######%%===+@#%%===@+*==+=%@@@@@@+*********=@%==========+..       \n    ...*=====+++=====%=:***+*+*+@#######@%%%%==++****+====%%%@#@@@#@++++++++=%=%@%====%%@:-.       .\n        .+======%%%%@@=**++++++=####@#####@%%%%%%%%%%%%=%@==@@#@%@##====++++=%=====%%%%+*:-..      .\n        -*+%%==%=%@@%%=++++====%#########@#@%%%%%%%%==@@+*%@########%======+===========+*:.         \n        .*+++===============+==@##############@%%%%%%==%%###@#######=.....-*=======+++++:.          \n        ..:++==========+-.. ..%###@@############@@@@@@@##########@##+.      ...:++==+:..            \n         ...:+++=====-..    ..@######@@###@######@@%+=@###@###@@####*          ......               \n               .....        .-@###@@##########@=**+%+:=@###########@.                               \n                             .*%@@@@@#########%*:*****+@##########@:.                              .\n                            ..**+++++========+**:::::**+=======++++-.                               \n                            ..*++++++++*::::::::---:::*****++++++***.                               \n                             .:+++**+***::-::::----::**:****++++***:.                               \n                              .*+++*+****:::::---::::::::****+*+++*.                                \n                              .==++++++*******:::::::::******+++++-            .                   .\n                             .*+%@====++++++****::::::*****++=+=@+:.                                \n                            .*++++=@@%========+++++++++++====@@%=++*-.                              \n                           .:++++=====@#@@%============%%@@@====++++*:.                             \n                          .:=++++==========%%@@######@%=========++++*+:.                            \n                          .+=====================%===%===%=====+++%@@@@:..                          \n                         .*@@@%==============%=====%=%%=%%%====%@@@@@@@%-.                          \n                         -@@@@@###@@%%======%=%===========+::=@@@@@@@@@@-                           \n                        .%@@@@@@@###%-.....-:******::-....   .*#@@@@@##=..                          \n                        -@%@@@###@*..                        .=##@@@@#@-                            \n                      ..+@@@@@@@=..                          .*@@@##@#:.                           .\n                      .=##@@@@@*..                            -@@####*.                             \n                     .-#######%.                             .@#####@#-                             \n                    .=########@.                             -########@-                    .       \n                 ..%##########+                             .@##########+...                .       \n                .%####@@####*.                              *##############=-.                      \n                *#########=.                                .:@###############=.                   .\n                ...:**:...                                      ...-*%#######@@%.                   \n                                                                      ...-:*++:.                    ";
	question[7][2][0] = "Ваз толд ми";
	question[7][2][1] = "представте что здесь выводиться осел";
	question[7][3][0] = "На канате";
	question[7][3][1] = "Жопу поднимати";
	question[7][4][0] = "О сома хачу дайте";
	question[7][4][1] = "Да накормите его уже!!!!";

	question[8][1][0] = "Колычев Михаил";
	question[8][1][1] = "Единственный житель планеты пицца";
	question[8][2][0] = "Демьяновский Дмитрий ";
	question[8][2][1] = "Нет его мем это МегаЛадонкин";
	question[8][3][0] = "Штанько Дмитрий";
	question[8][3][1] = "Вы думали что этот мистакес что-то может?(Вообще-то да)";
	question[8][4][0] = "Мы";
	question[8][4][1] = "Кто мы то, кто мы - ты  один здесь, вызывайте дурку";

	question[9][1][0] = "Синие";
	question[9][1][1] = "Да, Да я тоже так думаю";
	question[9][2][0] = "Золотое";
	question[9][2][1] = "Нет, чувак ты не прав";
	question[9][3][0] = "Какое Платье?";
	question[9][3][1] = "Скандальное платье 2014 года";
	question[9][4][0] = "Кашдый видет па сваему";
	question[9][4][1] = "Иш ты умник нашелся";

	question[10][1][0] = "От приятного?";
	question[10][1][1] = "Да исторически было именно так";
	question[10][2][0] = "От противного?";
	question[10][2][1] = "Хах нам этот вариант не нравился";
	question[10][3][0] = "Домой?";
	question[10][3][1] = "Колледж ваш второй дом";
	question[10][4][0] = "В пещеру уже?";
	question[10][4][1] = "Да иди уже";

	question[11][1][0] = "Бурбело";
	question[11][1][1] = "Я в осадке";
	question[11][2][0] = "Маковеева";
	question[11][2][1] = "Понятия не имею кто это";
	question[11][3][0] = "Рыбина";
	question[11][3][1] = "Лучшая историчка";
	question[11][4][0] = "Абоа-бубуа-Аосас";
	question[11][4][1] = "Я не удивлен что в каменном веке именно так";

	question[12][1][0] = "Дорога ярости";
	question[12][1][1] = "ХАХАХАХХАХАХ и так всю химию ХАХАХАХАХХАХА";
	question[12][2][0] = "Зверь";
	question[12][2][1] = "Я тебе больше скажу, Ты Карапитек";
	question[12][3][0] = "Человек";
	question[12][3][1] = "Это мы еще не доказали";
	question[12][4][0] = "Я КАРАПИТЕК";
	question[12][4][1] = "наконец то ты это признал";

	question[13][1][0] = "Мудрый человек";
	question[13][1][1] = "а вы и вправду м...м...м...удрый человек";
	question[13][2][0] = "Идиот";
	question[13][2][1] = "Не ну это не цитата, это база";
	question[13][3][0] = "Гений";
	question[13][3][1] = "Если вы выбрали этот вариант, вы точно не гений";
	question[13][4][0] = "Пещерный человек";
	question[13][4][1] = "Ну какой карапитек это выберет";

	question[14][1][0] = "Лосяш серия 'торжество разума'";
	question[14][1][1] = "Вот уж кто правда гениален";
	question[14][2][0] = "Лермонтов";
	question[14][2][1] = "Как ты вообще к этому выводу пришел";
	question[14][3][0] = "Толстой 'война и мир'";
	question[14][3][1] = "Ага щас конечно";
	question[14][4][0] = "О так это ж маиго друка жаль его сьели";
	question[14][4][1] = "Будешь филосовствовать и тебя съедят";


	setlocale(0, "");

	while (true) {
		point = 0;
		krapPoint = 0;
		system("cls");
		cout << "                                            Викто-викторина\n";
		cout << "[1] Играть\n";
		cout << "[2] Настройки\n";
		cout << "[3] Правила\n";
		cout << "[4] Выйти\n";
		chois = 0;
		while (chois < 1 || chois > 4)
		{

			cin >> chois;
			switch (chois)
			{
			case 1: {

				game(hard);
				if (hp = 0) {
					cout << "Вы проиграли" << endl;
				}
				if (krapPoint < hard / 3) {
					cout << "Вы набрали " << point << " Очков(а)";
				}
				else {
					cout << "Вы набрали " << point << " Очков(а) карапитека" << endl;
					cout << "#############+................:=%%%%@%%%@%@@@@@@@@@@@%@@@@@@@@@@@@@@@%%@@@%%%=+:-............+#############\n#############+.-............-+%@%%%=%=%%%%%%=====++=++======%@%@@@@@@@@@@@@@%%%%=:...........+#############\n#############+.............-*@%=+*****+++++*****:::::*++===%%@@@@@@@@@@@@@@@@%%%%=*-.........+#############\n#############+.............:==****:::*:::::::::::::****+++==%%%@@@@@@@@@@@%@@%%@%%%+-........+#############\n#############+............-***::*:-::::::::-::::::***++++====%%%%@@@@@@@@@@@@@@@@@%%=........+#############\n#############+...........:::::-:--:::::*****:::***+**++++*++====%%%@@@@@@@@@@@%%%%@@%+.......+#############\n#############+..........*=%%%%%%%===**+=====%%@@@@@%%@@@@@@%%=====%%@@@@@@@@@@@@@@@%%=-......+#############\n#############+.........-%@%%%%%@@@@%==%%%%%@@@%%%%%%@%%%%%%%@@%%%%==%%@@@@@@@@@@@@@@%=*......+#############\n#############+..........+=+=%%%%%@@@%%%%@@%@@%%=+*=%%++=%%%%@@@@%%%==%%@@@@@@@@@@@@@@=+......+#############\n#############+..........-===+##@@%=%%=+=+=%%===%%@=@%++%@@%%%%@@%%%%===%@@@@@@@@@@%==+*-.....+#############\n#############+...........*%%%=%%%++++=*:*=====+*:***++%===+===++======%%%@@@@@@@@%@%%=*-.....+#############\n#############+...........:*++==%==+:**::++=++*:::***+===++*+++===+===%%%%%@@@@@@@%=+==*-.....+#############\n#############+...........:-:*+**:::**::*++===++*::::::*:::*++++++=%%%%%%@@@@@@@@%%=+==:......+#############\n#############+-.........:*::---::*+--:-:**+++=+*+*+*****++++++==%%%%%%%%%@@@@@%@%%%===:......+#############\n#############+---......:***::***+*::***+===+*:*%***++++====%%%%%%%%%%%%%%@@@@@%%%%====:......+#############\n#############+--.....--+++******=%%%==%%@@@@%==%=:**+====%%%%%%%%%%%@@%@@@@@@@@%%%===%:......+#############\n#############+---..-.--=====+*-%@@%@%%%@%===%%%%*-:**++===%%%%%%%%@%@%%@%@@@@@%%=====%:......+#############\n#############+-----...-+%%%=+:-+=*:*++*::***+++*:::*++==%%%%%%%%%%%@@@@%@@@@@@%===++%@:......+#############\n#############+----------%%%=+*::*:-::::*+++=+******+%%%=%%%%%%%%%%@@@@@@@@@@@@@==++%@%-......+#############\n#############+-----------@%%=+*:::-::*++=+=============+++=+==%%%%%@%@@%@@@@@@@@@%@@%*.......+#############\n#############+-----------:@%==*:-:-:*::**+++=%=%%%%=+=++++++==%%%%%%%%%@@@@@##@@%%@@%:.......+#############\n#############+------------=%=**++***+=%%=+**:+==%%%@@%%=====%%%%%@%%@@@@@@@##@@%%%@@%:.......+#############\n#############+------------+%+%@##=+++****+=%@@#@%%=%@@@@%%@@%%%%@@@@@@@@@@##@@%%%%%@@=-......+#############\n#############+------------:%%@%==%%%%%===++*+++===%@@@@@@@@@@@@@@@@@@@@@@@#@@%%%%%%@@@%*--...+#############\n#############+-------------:%====:-:--::++=%%@%%%%%%%%%@%%@@@@@@@@@@@@#@@##@%%%%%%%%@@@@==*::+#############\n#############+--------------:%%%@@%@%%%%%%%%@%%%%%@%%%%%%%@@@@@@@@@@@#@@@@@%%%%%%%%@@@@@@%%%%@#############\n#############+---------------:@@%@%%========%%%%%%@@@@@@@@@@@@@@######@@@%%%%%%%%%%@%%%@@@%%%##############\n#############+-----------------%%%%%========%%%%@@@@@@@@@@####@###@@@@@%%%%%=%%%%%%%%%@@%%%%%@#############\n#############+------------------=@@%%@%%%%%%%@@@@@@##@@@###@##@@@@@@@%%%%%%%====%%%%%%%%%%%=%@#############\n#############+------------------:*@@@@@@@@@@@@#@@@######@@@@@@@@@@%%%%%%%%=======%%%%========@#############";
				}
				Sleep(4000);
			}
				  break;
			case 2: {
				Settings();
				chois = 2;
				system("cls");
			}
				  break;
			case 3: {
				rule();
				chois = 3;
			}
				  break;
			case 4: {
				return 0;
			}
				  break;

			default:
				cout << "Этой команды нет в списке\n";
				cout << "Введите команду: ";
				chois = 0;
				break;
			}
		}

	}
}